export const bangladeshLocations = [
  { division: 'বরিশাল', districts: ['বরগুনা', 'বরিশাল', 'ভোলা', 'ঝালকাঠি', 'পটুয়াখালী', 'পিরোজপুর'] },
  { division: 'চট্টগ্রাম', districts: ['বান্দরবান', 'ব্রাহ্মণবাড়ীয়া', 'চাঁদপুর', 'চট্টগ্রাম', 'কুমিল্লা', 'কক্সবাজার', 'ফেনী', 'খাগড়াছড়ি', 'লক্ষ্মীপুর', 'নোয়াখালী', 'রাঙ্গামাটি'] },
  { division: 'ঢাকা', districts: ['ঢাকা', 'ফরিদপুর', 'গাজীপুর', 'গোপালগঞ্জ', 'কিশোরগঞ্জ', 'মাদারীপুর', 'মানিকগঞ্জ', 'মুন্সিগঞ্জ', 'নারায়ণগঞ্জ', 'নরসিংদী', 'রাজবাড়ী', 'শরিয়তপুর', 'টাঙ্গাইল'] },
  { division: 'খুলনা', districts: ['বাগেরহাট', 'চুয়াডাঙ্গা', 'যশোর', 'ঝিনাইদহ', 'খুলনা', 'কুষ্টিয়া', 'মাগুরা', 'মেহেরপুর', 'নড়াইল', 'সাতক্ষীরা'] },
  { division: 'ময়মনসিংহ', districts: ['জামালপুর', 'ময়মনসিংহ', 'নেত্রকোনা', 'শেরপুর'] },
  { division: 'রাজশাহী', districts: ['বগুড়া', 'জয়পুরহাট', 'নওগাঁ', 'নাটোর', 'চাঁপাইনবাবগঞ্জ', 'পাবনা', 'রাজশাহী', 'সিরাজগঞ্জ'] },
  { division: 'রংপুর', districts: ['দিনাজপুর', 'গাইবান্ধা', 'কুড়িগ্রাম', 'লালমনিরহাট', 'নীলফামারী', 'পঞ্চগড়', 'রংপুর', 'ঠাকুরগাঁও'] },
  { division: 'সিলেট', districts: ['হবিগঞ্জ', 'মৌলভীবাজার', 'সুনামগঞ্জ', 'সিলেট'] },
] as const;

export const divisionNames = bangladeshLocations.map(({ division }) => division);